Autodesk.Revit.DB.ExportPDFSettings.FindByName(Autodesk.Revit.DB.Document,System.String)
Returns settings element by name.
document:
The document to find the settings with the specified name.
name:
Name of the settings to find.
Returns:
The settings element, or nullptr if not found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ExportPDFSettings.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.PDFExportOptions)
Returns an new created ExportPDFSettings element in the document with specified settings.
document:
Document where the settings will be created.
name:
Name to the settings.
options:
The options to be set.
Returns:
New instance of ExportPDFSettings just created in the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
Setting name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022